In [58]:
import pandas as pd
import numpy as np

In [59]:
mylist = [5.4, 6.1, 1.7, 99.8]
myarray = np.array(mylist)

In [60]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [61]:
print(myseries1[2])

1.7

In [62]:
mylabels = ['first', 'second', 'third', 'fourth']
myseries3 = pd.Series(data=mylist, index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [63]:
myseries4 = pd.Series(mylist, mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [64]:
print(myseries4['second'])

6.1

In [65]:
myseries5 = pd.Series([5.5, 1.1, 8.8, 1.6], ['first', 'second', 'third', 'fourth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
second    1.1
third     8.8
fourth    1.6
dtype: float64

first      10.9
second      7.2
third      10.5
fourth    101.4
dtype: float64

In [66]:
df1 = pd.concat([myseries4,myseries5], axis=1, sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  1.1
third    1.7  8.8
fourth  99.8  1.6

In [67]:
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -0.147943 -0.180650 -0.577274 -0.380627  1.126221
1  0.182329  0.438035 -0.811858  0.946115 -1.691349
2 -0.373611 -1.232014  0.535532  1.322828 -0.519467
3  1.634180 -0.134144 -1.203259  1.119370  0.147938
4 -1.757303  1.535594 -1.174196  1.415901 -0.617937

In [68]:
df3 = pd.DataFrame(np.random.randn(5,5), index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5'],
                  columns=['col 1', 'col 2', 'col 3', 'col 4', 'col 5'])
df3

          col 1     col 2     col 3     col 4     col 5
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519
row 2 -0.047540 -1.029300 -0.490623  0.127849 -0.175412
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705

In [69]:
print(df3['col 2'])
print('')
df3[['col 3', 'col 1']]

row 1    0.399701
row 2   -1.029300
row 3   -2.198375
row 4    1.013015
row 5    2.972361
Name: col 2, dtype: float64

          col 3     col 1
row 1 -0.796687  0.354371
row 2 -0.490623 -0.047540
row 3 -0.225581  0.317791
row 4  0.138625  0.244143
row 5 -0.382829  1.433036

In [70]:
df3.loc['row 4']

col 1    0.244143
col 2    1.013015
col 3    0.138625
col 4   -0.049078
col 5   -0.438558
Name: row 4, dtype: float64

In [71]:
df3.iloc[2]

col 1    0.317791
col 2   -2.198375
col 3   -0.225581
col 4    1.983471
col 5   -0.188284
Name: row 3, dtype: float64

In [72]:
df3.loc[['row 4', 'row 1'], ['col 2', 'col 3']]

          col 2     col 3
row 4  1.013015  0.138625
row 1  0.399701 -0.796687

In [73]:
df3>0

       col 1  col 2  col 3  col 4  col 5
row 1   True   True  False   True   True
row 2  False  False  False   True  False
row 3   True  False  False   True  False
row 4   True   True   True  False  False
row 5   True   True  False  False  False

In [74]:
print(df3[df3>0])

          col 1     col 2     col 3     col 4     col 5
row 1  0.354371  0.399701       NaN  1.053961  1.539519
row 2       NaN       NaN       NaN  0.127849       NaN
row 3  0.317791       NaN       NaN  1.983471       NaN
row 4  0.244143  1.013015  0.138625       NaN       NaN
row 5  1.433036  2.972361       NaN       NaN       NaN

In [75]:
df3['col 6'] = np.random.randn(5,1)
df3

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -0.047540 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [76]:
df3.drop('col 1', axis=1)

          col 2     col 3     col 4     col 5     col 6
row 1  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [77]:
df3

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -0.047540 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [78]:
df4 = df3.drop('col 1', axis=1)
df4

          col 2     col 3     col 4     col 5     col 6
row 1  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [79]:
df5 = df3.drop('row 2', axis=0)
df5

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [80]:
df5.reset_index()

   index     col 1     col 2     col 3     col 4     col 5     col 6
0  row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
1  row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
2  row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
3  row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [81]:
df5

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [83]:
df5.reset_index(inplace=True)
df5

   index     col 1     col 2     col 3     col 4     col 5     col 6
0  row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
1  row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
2  row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
3  row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [85]:
df5['new name'] = ['This', 'is', 'the', 'row']
df5

   index     col 1     col 2     col 3     col 4     col 5     col 6 new name
0  row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076     This
1  row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216       is
2  row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486      the
3  row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899      row

In [86]:
df5.set_index('new name', inplace=True)
df5

          index     col 1     col 2     col 3     col 4     col 5     col 6
new name
This      row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
is        row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
the       row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row       row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [87]:
df5.mean()

col 1    0.587335
col 2    0.546676
col 3   -0.316618
col 4    0.472130
col 5    0.015743
col 6   -0.728361
dtype: float64

### Combining data frames

* concat
* join
* merge

In [89]:
df7 = pd.DataFrame({"customer":['101','102','103','104'],
                   'category': ['cat2', 'cat2', 'cat1', 'cat3'],
                   'important': ['yes', 'no', 'yes', 'yes'],
                   'sales': [123,52,214,663]}, index=[0,1,2,3])
df7

  customer category important  sales
0      101     cat2       yes    123
1      102     cat2        no     52
2      103     cat1       yes    214
3      104     cat3       yes    663

In [95]:
df8 = pd.DataFrame({"customer":['101', '103', '104', '105'],
                   'color': ['yellow','green','green','blue'],
                   'distance':[12,9,44,21],
                   'sales':[123,214,663,331]}, index=[4,5,6,7])
df8

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [96]:
pd.concat([df7,df8], axis=0, sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [97]:
pd.concat([df7,df8], axis=0, sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [98]:
pd.concat([df7,df8], axis=1, sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [99]:
pd.merge(df7,df8, how='outer', on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [100]:
pd.merge(df7,df8, how='inner', on='customer')

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [101]:
dfl = pd.merge(df7,df8,how='left',on='customer')
dfr = pd.merge(df7,df8,how='right',on='customer')
print(dfl)
print(dfr)

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0
  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [103]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                    index=['I0', 'I1', 'I2'])
df9

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [104]:
df10 = pd.DataFrame({'Q3': [301,302,303],
                     'Q4': [401,402,403]},
                     index=['I0', 'I2', 'I3'])
df10

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [108]:
df9.join(df10, how='outer')

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  203.0  302.0  402.0
I3    NaN    NaN  303.0  403.0

In [109]:
df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [110]:
df8['color'].value_counts()

green     2
yellow    1
blue      1
Name: color, dtype: int64

In [111]:
df9.mean()

Q1    102.0
Q2    202.0
dtype: float64

In [113]:
df8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [114]:
df8

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [115]:
new_df = df8[(df8['customer']!='105') & (df8['color'] != 'green')]
new_df

  customer   color  distance  sales
4      101  yellow        12    123

In [116]:
print(df8['sales'].mean())
print(df8['distance'].min())

332.75
9

In [131]:
def profit(s):
    return s*.5 # Profit is 50% of sales

In [132]:
df8['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [133]:
df8['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [134]:
df11 = df8[['distance','sales']]
print(df11)
print(df11.apply(profit))

   distance  sales
4        12    123
5         9    214
6        44    663
7        21    331
   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [135]:
def col_sum(col):
    return sum(col)

df11.apply(col_sum)

distance      86
sales       1331
dtype: int64

In [136]:
df11.applymap(col_sum)

TypeError: 'int' object is not iterable

In [137]:
df8

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [138]:
del df8['color']
df8

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

In [139]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [140]:
df8.sort_values(by='distance')

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [143]:
mydict = {'customer': ['C1', 'C1', 'C2', 'C2', 'C3', 'C3'],
         'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
         'product2': [8.2,9.1,11.1,5.2,44.66,983]}

df6 = pd.DataFrame(mydict, index=['Purchase 1','Purchase 2', 'Purchase 3', 'Purchase 4', 'Purchase 5', 'Purchase 6'])
df6

           customer  product1  product2
Purchase 1       C1       1.1      8.20
Purchase 2       C1       2.1      9.10
Purchase 3       C2       3.8     11.10
Purchase 4       C2       4.2      5.20
Purchase 5       C3       5.5     44.66
Purchase 6       C3       6.9    983.00

In [144]:
grouped_data = df6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f9e509f2580>

In [148]:
grouped_data.describe()

         product1                                           product2          \
            count mean       std  min   25%  50%   75%  max    count    mean
customer
C1            2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0    8.65
C2            2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0    8.15
C3            2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0  513.83


                 std    min      25%     50%      75%    max
customer
C1          0.636396   8.20    8.425    8.65    8.875    9.1
C2          4.171930   5.20    6.675    8.15    9.625   11.1
C3        663.506577  44.66  279.245  513.83  748.415  983.0

In [150]:
grouped_data.mean()

          product1  product2
customer
C1             1.6      8.65
C2             4.0      8.15
C3             6.2    513.83

In [151]:
grouped_data.std()

          product1    product2
customer
C1        0.707107    0.636396
C2        0.282843    4.171930
C3        0.989949  663.506577